
&НаСервере
Процедура ОкНаСервере()
	Набор = РегистрыСведений.Цены.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(Период, Истина);
	Набор.Прочитать();
	Для Каждого ОчереднаяЗапись Из Набор Цикл
		Сообщить("Номенклатура = "+ ОчереднаяЗапись.Номенклатура +", цена = "+ ОчереднаяЗапись.Цена);
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ОкНаСервере();
КонецПроцедуры

&НаСервере
Процедура Ок2НаСервере()
	Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если не Выборка.ЭтоГруппа Тогда
			//Отборка = Новый Структура("Номенклатура",Выборка);
			Набор = РегистрыСведений.Цены.СоздатьНаборЗаписей();
			Набор.Прочитать();
			Сообщить("Товар :" + Выборка + " Код: " + Выборка.Код);
			Для Каждого ОчереднаяЗапись Из Набор Цикл
				Если ОчереднаяЗапись.Номенклатура.Наименование = Выборка.Наименование Тогда
					Сообщить("Цена = "+ ОчереднаяЗапись.Цена);
				КонецЕсли;
			КонецЦикла;
			//ВозЗнач =  РегистрыСведений.Цены.ПолучитьПоследнее(Период,Отборка);
			//Сообщить("   Цена :" + ВозЗнач.Цена);
			//Набор = РегистрыСведений.Цены.СоздатьНаборЗаписей();
			//Набор.Отбор.Период.Установить(Период, Истина);
			//Набор.Прочитать();
			//Для Каждого ОчереднаяЗапись Из Набор Цикл
			//	Сообщить("Номенклатура = "+ ОчереднаяЗапись.Номенклатура +", цена = "+ ОчереднаяЗапись.Цена);
			//КонецЦикла;
			
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Ок2(Команда)
	Ок2НаСервере();
КонецПроцедуры
